RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
    /*
     * We will update this to owned later if appropriate - for now set to false
     * so we don't try to free if we fail before allocating a clock
     */
    obj->is_clock_owned = false;

    obj->user_enabled_events = 0u;

    obj->callback_data.callback = NULL;
    obj->callback_data.callback_arg = NULL;
    obj->async_mode = CYHAL_ASYNC_SW;
    obj->async_tx_buff = NULL;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    obj->async_rx_buff = NULL;
#endif
    obj->tx_dma.resource.type = CYHAL_RSC_INVALID;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    obj->rx_dma.resource.type = CYHAL_RSC_INVALID;
#endif

    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Determine which I2S instance to use */
    const cyhal_resource_pin_mapping_t *tx_sck_map = (NULL != tx_pins) ? _CYHAL_UTILS_GET_RESOURCE(tx_pins->sck, _CYHAL_AUDIOSS_TX_SCK_MAP) : NULL;
    const cyhal_resource_pin_mapping_t *tx_ws_map  = (NULL != tx_pins) ? _CYHAL_UTILS_GET_RESOURCE(tx_pins->ws, _CYHAL_AUDIOSS_TX_WS_MAP) : NULL;
    const cyhal_resource_pin_mapping_t *tx_sdo_map = (NULL != tx_pins) ? _CYHAL_UTILS_GET_RESOURCE(tx_pins->data, _CYHAL_AUDIOSS_TX_SDO_MAP) : NULL;

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    const cyhal_resource_pin_mapping_t *rx_sck_map = (NULL != rx_pins) ? _CYHAL_UTILS_GET_RESOURCE(rx_pins->sck, _CYHAL_AUDIOSS_RX_SCK_MAP) : NULL;
    const cyhal_resource_pin_mapping_t *rx_ws_map  = (NULL != rx_pins) ? _CYHAL_UTILS_GET_RESOURCE(rx_pins->ws, _CYHAL_AUDIOSS_RX_WS_MAP) : NULL;
    const cyhal_resource_pin_mapping_t *rx_sdi_map = (NULL != rx_pins) ? _CYHAL_UTILS_GET_RESOURCE(rx_pins->data, _CYHAL_AUDIOSS_RX_SDI_MAP) : NULL;
#endif
    const cyhal_resource_pin_mapping_t *mclk_map_rx = NULL;
    const cyhal_resource_pin_mapping_t *mclk_map_tx = NULL;

#if !defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(rx_pins != NULL)
    {
        result = interface->err_not_supported;
    }
#endif
#if !defined(_CYHAL_AUDIOSS_TX_SLAVE_AVAILABLE)
    if(config->is_tx_slave)
    {
        result = interface->err_not_supported;
    }
#endif
#if defined(CY_IP_MXAUDIOSS)
    if(NULL != tx_pins && NULL != rx_pins && tx_pins->mclk != rx_pins->mclk)
    {
        /* RX and TX must share the same MCLK pin (or lack thereof) on this IP */
        result = obj->interface->err_invalid_pin;
    }

    mclk_map_rx = (NULL != rx_pins) ? _CYHAL_UTILS_GET_RESOURCE(rx_pins->mclk, cyhal_pin_map_audioss_clk_i2s_if) : NULL;
    mclk_map_tx = (NULL != tx_pins) /* If non-null, we know the mclk pins must be the same, so can reuse the rx value */
              ? ((NULL != mclk_map_rx) ? mclk_map_rx : _CYHAL_UTILS_GET_RESOURCE(tx_pins->mclk, cyhal_pin_map_audioss_clk_i2s_if))
          : NULL;

    uint8_t mclk_rx_dm = CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_CLK_I2S_IF;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    uint8_t mclk_tx_dm = CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_CLK_I2S_IF;
#endif
#elif defined(CY_IP_MXTDM)
    mclk_map_rx = (NULL != rx_pins) ? _CYHAL_UTILS_GET_RESOURCE(rx_pins->mclk, cyhal_pin_map_tdm_tdm_rx_mck) : NULL;
    mclk_map_tx = (NULL != tx_pins) ? _CYHAL_UTILS_GET_RESOURCE(tx_pins->mclk, cyhal_pin_map_tdm_tdm_tx_mck) : NULL;

    uint8_t mclk_rx_dm = CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_RX_MCK;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    uint8_t mclk_tx_dm = CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_TX_MCK;
#endif
#endif

#if defined(CY_IP_MXAUDIOSS)
    cyhal_resource_t rsc_type = CYHAL_RSC_I2S;
#elif defined(CY_IP_MXTDM)
    cyhal_resource_t rsc_type = CYHAL_RSC_TDM;
#endif

    if(CY_RSLT_SUCCESS == result && NULL != tx_pins) /* It is valid to leave either tx or rx empty */
    {
        if(NULL != tx_sck_map && NULL != tx_ws_map && NULL != tx_sdo_map
            && _cyhal_utils_map_resources_equal_all(3, tx_sck_map, tx_ws_map, tx_sdo_map))
        {
            _CYHAL_UTILS_ASSIGN_RESOURCE(obj->resource, rsc_type, tx_sck_map);
        }
        else
        {
            result = obj->interface->err_invalid_pin;
        }
    }

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(CY_RSLT_SUCCESS == result && NULL != rx_pins)
    {
        if(NULL == rx_sck_map || NULL == rx_ws_map || NULL == rx_sdi_map ||
            (false == _cyhal_utils_map_resources_equal_all(3, rx_sck_map, rx_ws_map, rx_sdi_map)))
        {
            result = obj->interface->err_invalid_pin;
        }
        else
        {
            if((obj->resource.type != CYHAL_RSC_INVALID)
                && (false == _cyhal_utils_map_resource_equal(&(obj->resource), rx_sck_map, false)))
            {
                /* TX pins and RX pins don't map to the same instance */
                result = obj->interface->err_invalid_pin;
            }
            _CYHAL_UTILS_ASSIGN_RESOURCE(obj->resource, rsc_type, rx_sck_map);
        }
    }
#endif

    if(CYHAL_RSC_INVALID == obj->resource.type) /* If this happens it means neither rx nor tx was specified */
    {
        result = obj->interface->err_invalid_pin;
    }

    if(CY_RSLT_SUCCESS == result && NULL != rx_pins && CYHAL_NC_PIN_VALUE != rx_pins->mclk )
    {
        if(NULL == mclk_map_rx || (false == _cyhal_utils_map_resource_equal(&(obj->resource), mclk_map_rx, false)))
        {
            result = obj->interface->err_invalid_pin;
        }
    }

    if(CY_RSLT_SUCCESS == result && NULL != tx_pins && CYHAL_NC_PIN_VALUE != tx_pins->mclk )
    {
        if(NULL == mclk_map_tx || (false == _cyhal_utils_map_resource_equal(&(obj->resource), mclk_map_tx, false)))
        {
            result = obj->interface->err_invalid_pin;
        }
    }

#if defined(CY_IP_MXAUDIOSS)
    const uint8_t MAX_CHANNELS = 8u; /* I2S will already have limited to a lower count */
#elif defined(CY_IP_MXTDM)
    const uint8_t MAX_CHANNELS = _cyhal_audioss_max_channels[obj->resource.block_num];
#endif
    if(CY_RSLT_SUCCESS == result && config->num_channels > MAX_CHANNELS)
    {
        result = obj->interface->err_invalid_arg;
    }

#if defined(CY_IP_MXAUDIOSS)
    // This IP doesn't support disabling individual channels, just reducing the overall count
    for(size_t i = 0; i < sizeof(config->channel_mask) * 8 /* bits per byte */; ++i)
    {
        bool chan_enabled = (0u != (config->channel_mask & ((uint32_t)1u << i)));
        bool is_selected_channel = (i < config->num_channels);
        if(is_selected_channel != chan_enabled)
        {
            result = obj->interface->err_invalid_arg;
            break;
        }
    }
#endif

    if(CY_RSLT_SUCCESS == result)
    {
        result = cyhal_hwmgr_reserve(&(obj->resource));
    }

    if(CY_RSLT_SUCCESS != result)
    {
        // If we aren't successful by here, we didn't manage to reserve the hardware resource,
        // so mark it as invalid to ensure it isn't incorrectly freed.
        obj->resource.type = CYHAL_RSC_INVALID;
    }

