RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
    /* Reserve the pins */
    if(CY_RSLT_SUCCESS == result && NULL != tx_pins)
    {
        result = _cyhal_utils_reserve_and_connect(tx_sck_map, _CYHAL_AUDIOSS_DRIVE_MODE_TX_SCK);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_tx_sck = tx_pins->sck;
            result = _cyhal_utils_reserve_and_connect(tx_ws_map, _CYHAL_AUDIOSS_DRIVE_MODE_TX_WS);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_tx_ws = tx_pins->ws;
            result = _cyhal_utils_reserve_and_connect(tx_sdo_map, _CYHAL_AUDIOSS_DRIVE_MODE_TX_SDO);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_tx_sdo = tx_pins->data;
        }
#if defined(_CYHAL_AUDIOSS_TX_SLAVE_AVAILABLE)
        // In slave mode, the clock and word select pins are inputs
        if(CY_RSLT_SUCCESS == result && config->is_tx_slave)
        {
            result = cyhal_gpio_configure(obj->pin_tx_sck, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            if(CY_RSLT_SUCCESS == result)
            {
                result = cyhal_gpio_configure(obj->pin_tx_ws, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            }
        }
#endif

    }

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(CY_RSLT_SUCCESS == result && NULL != rx_pins)
    {
        result = _cyhal_utils_reserve_and_connect(rx_sck_map, _CYHAL_AUDIOSS_DRIVE_MODE_RX_SCK);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_rx_sck = rx_pins->sck;
            result = _cyhal_utils_reserve_and_connect(rx_ws_map, _CYHAL_AUDIOSS_DRIVE_MODE_RX_WS);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_rx_ws = rx_pins->ws;
            result = _cyhal_utils_reserve_and_connect(rx_sdi_map, _CYHAL_AUDIOSS_DRIVE_MODE_RX_SDI);
        }
        if(CY_RSLT_SUCCESS == result)
        {
            obj->pin_rx_sdi = rx_pins->data;
        }

        // In slave mode, the clock and word select pins are inputs
        if(CY_RSLT_SUCCESS == result && config->is_rx_slave)
        {
            result = cyhal_gpio_configure(obj->pin_rx_sck, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            if(CY_RSLT_SUCCESS == result)
            {
                result = cyhal_gpio_configure(obj->pin_rx_ws, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE);
            }
        }
    }
#endif

    bool has_mclk = NULL != mclk_map_rx || NULL != mclk_map_tx;
    if(CY_RSLT_SUCCESS == result && has_mclk)
    {
        if(config->mclk_hz == 0)
        {
            // Must specify mclk frequency when using mclk
            result = obj->interface->err_invalid_arg;
        }
        else
        {
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
            if(NULL != mclk_map_rx)
            {
                result = _cyhal_utils_reserve_and_connect(mclk_map_rx, mclk_tx_dm);
                if(CY_RSLT_SUCCESS == result)
                {
                    obj->pin_rx_mclk = mclk_map_rx->pin;
                    obj->mclk_hz_rx = config->mclk_hz;
                }
            }
#endif
            if(CY_RSLT_SUCCESS == result && NULL != mclk_map_tx)
            {
                /* Don't try to reserve twice if rx and tx mclk are the same pin */
                if(NULL == mclk_map_rx || mclk_map_tx->pin != mclk_map_rx->pin)
                {
                    result = _cyhal_utils_reserve_and_connect(mclk_map_tx, mclk_rx_dm);
                }
                if(CY_RSLT_SUCCESS == result)
                {
                    obj->pin_tx_mclk = mclk_map_tx->pin;
                    obj->mclk_hz_tx = config->mclk_hz;
                }
            }
        }
    }

    if(CY_RSLT_SUCCESS == result && false == has_mclk)
    {
        // Must not specify mclk frequency when mclk pin is not in use
        if(config->mclk_hz != 0)
        {
            result = obj->interface->err_invalid_arg;
        }
    }

    /* In this init flow rx and tx have the same lengths so we just need to check tx */
    if(CY_RSLT_SUCCESS == result && obj->word_length_tx > obj->channel_length_tx)
    {
        // Word length must be less than or equal to channel length
        result = obj->interface->err_invalid_arg;
    }

    if(CY_RSLT_SUCCESS == result && obj->channel_length_tx > _CYHAL_AUDIOSS_MAX_CHANNEL_LENGTH)
    {
        // Channel length on MXAUDIOSS is more restricted than this, but that is
        // checked in populate_pdl_config. There is also a lower bound of 4
        // on MXTDM but that is taken care of by the check above because
        // 8 bits is the smallest word length we support.
        result = obj->interface->err_invalid_arg;
    }

    if (CY_RSLT_SUCCESS == result)
    {
        bool all_mclk = (NULL == rx_pins || CYHAL_NC_PIN_VALUE != rx_pins->mclk)
                     && (NULL == tx_pins || CYHAL_NC_PIN_VALUE != tx_pins->mclk);

        result = _cyhal_audioss_init_clock(obj, clk, all_mclk);
    }

    uint16_t sclk_div_tx = 0;
    uint16_t sclk_div_rx = 0;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(CY_RSLT_SUCCESS == result && NULL != rx_pins)
    {
        result = _cyhal_audioss_compute_sclk_div(obj, config->sample_rate_hz, obj->mclk_hz_rx, obj->channel_length_rx, config->num_channels, &sclk_div_rx);
    }
    #endif
    if(CY_RSLT_SUCCESS == result && NULL != tx_pins)
    {
        result = _cyhal_audioss_compute_sclk_div(obj, config->sample_rate_hz, obj->mclk_hz_tx, obj->channel_length_tx, config->num_channels, &sclk_div_tx);
    }

    _cyhal_audioss_pdl_config_t pdl_config;
    memset(&pdl_config, 0, sizeof(pdl_config));
#if defined(CY_IP_MXTDM)
    cy_stc_tdm_config_tx_t tx_config;
    cy_stc_tdm_config_rx_t rx_config;
    pdl_config.tx_config = &tx_config;
    pdl_config.rx_config = &rx_config;
#endif
    if (CY_RSLT_SUCCESS == result)
    {
        bool tx_en = (CYHAL_NC_PIN_VALUE != obj->pin_tx_sdo);
        bool tx_mclk = (CYHAL_NC_PIN_VALUE != obj->pin_tx_mclk);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        bool rx_en = (CYHAL_NC_PIN_VALUE != obj->pin_rx_sdi);
        bool rx_mclk = (CYHAL_NC_PIN_VALUE != obj->pin_rx_mclk);
#else
        bool rx_en = false;
        bool rx_mclk = false;
#endif
        result = _cyhal_audioss_populate_pdl_config(obj, &pdl_config, config, sclk_div_rx, sclk_div_tx, rx_en, tx_en, rx_mclk, tx_mclk);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_init_hw(obj, &pdl_config);
    }

    if (CY_RSLT_SUCCESS != result)
    {
        _cyhal_audioss_free(obj);
    }
    return result;
}

cy_rslt_t _cyhal_audioss_init_cfg(_cyhal_audioss_t *obj, const _cyhal_audioss_configurator_t *cfg, const _cyhal_audioss_interface_t* interface)
{
    CY_ASSERT(NULL != obj);

    memset(obj, 0, sizeof(_cyhal_audioss_t));
    obj->owned_by_configurator = true;
    obj->resource = *cfg->resource;
    obj->mclk_hz_tx = cfg->mclk_hz_tx;
    obj->interface = interface;

