RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
    obj->async_mode        = CYHAL_ASYNC_SW;
    obj->tx_dma.resource.type = CYHAL_RSC_INVALID;
#if defined(CY_IP_MXAUDIOSS)
    obj->channel_length_tx = _cyhal_audioss_length_from_pdl(cfg->config->txChannelLength);
    obj->word_length_tx    = _cyhal_audioss_length_from_pdl(cfg->config->txWordLength);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    obj->channel_length_rx = _cyhal_audioss_length_from_pdl(cfg->config->rxChannelLength);
    obj->word_length_rx    = _cyhal_audioss_length_from_pdl(cfg->config->rxWordLength);
#endif
#elif defined(CY_IP_MXTDM)
    obj->channel_length_tx = cfg->config->tx_config->channelSize;
    obj->word_length_tx    = _cyhal_audioss_length_from_pdl(cfg->config->tx_config->wordSize);
    obj->channel_length_rx = cfg->config->rx_config->channelSize;
    obj->word_length_rx    = _cyhal_audioss_length_from_pdl(cfg->config->rx_config->wordSize);
#endif
    obj->pin_tx_sck        = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_ws         = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_sdo        = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_mclk       = CYHAL_NC_PIN_VALUE;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    obj->rx_dma.resource.type = CYHAL_RSC_INVALID;
    obj->pin_rx_sck        = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_ws         = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_sdi        = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_mclk       = CYHAL_NC_PIN_VALUE;
#endif

#if defined(CY_IP_MXAUDIOSS)
    bool all_mclk = (0u != obj->mclk_hz_tx); /* No separate rx/tx clock selection */
#elif defined(CY_IP_MXTDM)
    bool all_mclk = ((false == cfg->config->rx_config->enable) || (CY_TDM_SEL_MCLK_IN == cfg->config->rx_config->clkSel))
                 && ((false == cfg->config->tx_config->enable) || (CY_TDM_SEL_MCLK_IN == cfg->config->tx_config->clkSel));
#endif
    cy_rslt_t result = _cyhal_audioss_init_clock(obj, cfg->clock, all_mclk);

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_init_hw(obj, cfg->config);
    }

    if(CY_RSLT_SUCCESS != result)
    {
        _cyhal_audioss_free(obj);
    }
    return result;
}

void _cyhal_audioss_free(_cyhal_audioss_t *obj)
{
    CY_ASSERT(NULL != obj);

    if(CYHAL_RSC_INVALID != obj->resource.type)
    {
#if defined(CY_IP_MXAUDIOSS)
        _cyhal_system_irq_t irqn = _cyhal_audioss_irq_n[obj->resource.block_num];
        _cyhal_irq_free(irqn);
#elif defined(CY_IP_MXTDM)
        _cyhal_system_irq_t irqn = _cyhal_audioss_rx_irq_n[obj->resource.block_num];
        _cyhal_irq_free(irqn);
        irqn = _cyhal_audioss_tx_irq_n[obj->resource.block_num];
        _cyhal_irq_free(irqn);
#endif

        _cyhal_syspm_unregister_peripheral_callback(&(obj->pm_callback));
        if(NULL != obj->base)
        {
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
            _cyhal_audioss_stop_rx(obj);
#endif
            _cyhal_audioss_stop_tx(obj);

#if defined(CY_IP_MXTDM)
            Cy_AudioTDM_DisableTx(&obj->base->TDM_TX_STRUCT);
            Cy_AudioTDM_DisableRx(&obj->base->TDM_RX_STRUCT);
#endif
        }
        if(false == obj->owned_by_configurator)
        {
            cyhal_hwmgr_free(&(obj->resource));
        }

        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;
    }

    /* Need to check this before we start releasing because release_if_used
     * sets the pin to NC once it is done */
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    bool different_mclk = (obj->pin_rx_mclk != obj->pin_tx_mclk);
#endif
    _cyhal_utils_release_if_used(&(obj->pin_tx_sck));
    _cyhal_utils_release_if_used(&(obj->pin_tx_ws));
    _cyhal_utils_release_if_used(&(obj->pin_tx_sdo));
    _cyhal_utils_release_if_used(&(obj->pin_tx_mclk));
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    _cyhal_utils_release_if_used(&(obj->pin_rx_sck));
    _cyhal_utils_release_if_used(&(obj->pin_rx_ws));
    _cyhal_utils_release_if_used(&(obj->pin_rx_sdi));
    if(different_mclk)
    {
        _cyhal_utils_release_if_used(&(obj->pin_rx_mclk));
    }
#endif
    if(obj->is_clock_owned)
    {
        cyhal_clock_free(&(obj->clock));
    }

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(CYHAL_RSC_INVALID != obj->rx_dma.resource.type)
    {
        cyhal_dma_free(&obj->rx_dma);
    }
#endif

    if(CYHAL_RSC_INVALID != obj->tx_dma.resource.type)
    {
        cyhal_dma_free(&obj->tx_dma);
    }
}

static uint8_t _cyhal_audioss_fifo_trigger_level(_cyhal_audioss_t* obj, bool is_tx)
{
#if defined(CY_IP_MXAUDIOSS)
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    return is_tx
        ? (uint8_t)_FLD2VAL(I2S_TX_FIFO_CTL_TRIGGER_LEVEL, REG_I2S_TX_FIFO_CTL(obj->base))
        : (uint8_t)_FLD2VAL(I2S_RX_FIFO_CTL_TRIGGER_LEVEL, REG_I2S_RX_FIFO_CTL(obj->base));
#else
    CY_UNUSED_PARAMETER(is_tx);
    return (uint8_t)_FLD2VAL(I2S_TX_FIFO_CTL_TRIGGER_LEVEL, REG_I2S_TX_FIFO_CTL(obj->base));
#endif
#elif defined(CY_IP_MXTDM)
    return is_tx
        ? (uint8_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_TRIGGER_LEVEL, TDM_STRUCT_TX_FIFO_CTL(&obj->base->TDM_TX_STRUCT))
        : (uint8_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_TRIGGER_LEVEL, TDM_STRUCT_RX_FIFO_CTL(&obj->base->TDM_RX_STRUCT));
#endif
}

static bool _cyhal_audioss_is_direction_enabled(_cyhal_audioss_t *obj, bool is_tx)
{
#if defined(CY_IP_MXAUDIOSS)
    return is_tx
        ? (0u != (REG_I2S_CTL(obj->base) & I2S_CTL_TX_ENABLED_Msk))
        : (0u != (REG_I2S_CTL(obj->base) & I2S_CTL_RX_ENABLED_Msk));
#elif defined(CY_IP_MXTDM)
    return is_tx
        ? (0u != (TDM_STRUCT_TX_CTL(&obj->base->TDM_TX_STRUCT) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_ENABLED_Msk))
        : (0u != (TDM_STRUCT_RX_CTL(&obj->base->TDM_RX_STRUCT) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_ENABLED_Msk));
#endif
}

/* Note: This function is called prior to PDL init, and again from set_sample_rate. This means that
 * it cannot safely query either register values (which may not be initialized), nor pin values (which
 * are not populated in the configurator init flow) */
static cy_rslt_t _cyhal_audioss_compute_sclk_div(_cyhal_audioss_t *obj, uint32_t sample_rate_hz, uint32_t mclk_hz, uint8_t channel_length, uint8_t num_channels, uint16_t *sclk_div)
{
#if defined(CY_IP_MXAUDIOSS)
    const uint8_t SCLK_INCREMENT = 1;
    const uint8_t MIN_SCLK_DIVIDER = 1;
    const uint8_t MAX_SCLK_DIVIDER = 64; // Divider value internal to the I2S block
#elif defined(CY_IP_MXTDM)
    const uint8_t MIN_SCLK_DIVIDER = 2;
    const uint8_t SCLK_INCREMENT = 2; // Per PDL, should be set to an even value to ensure 50/50 duty cycle
    const uint16_t MAX_SCLK_DIVIDER = 256; // Divider value internal to the I2S block
#endif

    const cyhal_clock_tolerance_t SCLK_TOLERANCE = { .type = CYHAL_TOLERANCE_PERCENT, .value = 1 };
    uint32_t sclk_target = sample_rate_hz * channel_length * num_channels;
    *sclk_div = 0;

