RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
cy_rslt_t _cyhal_audioss_clear_rx(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_ClearRxFifo(obj->base);
#elif defined(CY_IP_MXTDM)
    /* No way to explicitly clear the FIFO, so disable and re-enable
     * which will clear the FIFO as a side effect, while retaining
     * all other configuration */
     bool was_active = _cyhal_audioss_is_rx_enabled(obj);
     Cy_AudioTDM_DisableRx(&obj->base->TDM_RX_STRUCT);
     Cy_AudioTDM_EnableRx(&obj->base->TDM_RX_STRUCT);
     if(was_active)
     {
         Cy_AudioTDM_ActivateRx(&obj->base->TDM_RX_STRUCT);
     }
#endif
    return CY_RSLT_SUCCESS;
#else
    return obj->interface->err_not_supported;
#endif
}

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
// Reads until empty, then updates the length and buffer address to their new locations
static void _cyhal_audioss_read_until_empty(_cyhal_audioss_t *obj, void** buffer, size_t* length)
{
    // The buffer is the smallest type that will hold the word length
    // The structure of this function deliberately accepts duplication of the outer loop
    // structure in order to avoid having to recheck the word length every time around,
    // because this function is in a performance sensitive code path.
    if(obj->word_length_rx <= 8)
    {
        uint8_t *cast_buffer = (uint8_t*)(*buffer);

        while(*length > 0 && _cyhal_audioss_get_num_in_fifo(obj, false) > 0)
        {
            *cast_buffer = (uint8_t)_cyhal_audioss_read_fifo(obj);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else if(obj->word_length_rx <= 16)
    {
        uint16_t *cast_buffer = (uint16_t*)(*buffer);

        while(*length > 0 && _cyhal_audioss_get_num_in_fifo(obj, false) > 0)
        {
            *cast_buffer = (uint16_t)_cyhal_audioss_read_fifo(obj);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else
    {
        CY_ASSERT(obj->word_length_rx <= 32);
        uint32_t *cast_buffer = (uint32_t*)(*buffer);

        while(*length > 0 && _cyhal_audioss_get_num_in_fifo(obj, false) > 0)
        {
            *cast_buffer = _cyhal_audioss_read_fifo(obj);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
}
#endif

cy_rslt_t _cyhal_audioss_read(_cyhal_audioss_t *obj, void *data, size_t* length)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    size_t remaining = *length;
    _cyhal_audioss_read_until_empty(obj, &data, &remaining);
    *length -= remaining;
    return CY_RSLT_SUCCESS;
#else
    CY_UNUSED_PARAMETER(data);
    CY_UNUSED_PARAMETER(length);
    return obj->interface->err_not_supported;
#endif
}

static void _cyhal_audioss_write_until_full(_cyhal_audioss_t *obj, const void** buffer, size_t *length)
{
    // The buffer is the smallest type that will hold the word length
    // The structure of this function deliberately accepts duplication of the outer loop
    // structure in order to avoid having to recheck the word length every time around,
    // because this function is in a performance sensitive code path.
    if(obj->word_length_tx <= 8)
    {
        const uint8_t *cast_buffer = (const uint8_t*)(*buffer);

        while(*length > 0 && _cyhal_audioss_get_num_in_fifo(obj, true) < _CYHAL_AUDIOSS_FIFO_DEPTH)
        {
            _cyhal_audioss_write_fifo(obj, *cast_buffer);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else if(obj->word_length_tx <= 16)
    {
        const uint16_t *cast_buffer = (const uint16_t*)(*buffer);

        while(*length > 0 && _cyhal_audioss_get_num_in_fifo(obj, true) < _CYHAL_AUDIOSS_FIFO_DEPTH)
        {
            _cyhal_audioss_write_fifo(obj, *cast_buffer);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else
    {
        CY_ASSERT(obj->word_length_tx <= 32);
        const uint32_t *cast_buffer = (const uint32_t*)(*buffer);

        while(*length > 0 && _cyhal_audioss_get_num_in_fifo(obj, true) < _CYHAL_AUDIOSS_FIFO_DEPTH)
        {
            _cyhal_audioss_write_fifo(obj, *cast_buffer);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
}

cy_rslt_t _cyhal_audioss_write(_cyhal_audioss_t *obj, const void *data, size_t *length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    size_t remaining = *length;
    _cyhal_audioss_write_until_full(obj, &data, &remaining);
    *length -= remaining;
    return CY_RSLT_SUCCESS;
}

bool _cyhal_audioss_is_tx_enabled(_cyhal_audioss_t *obj)
{
    CY_ASSERT(NULL != obj);

#if defined(CY_IP_MXAUDIOSS)
    return (0 != (CY_I2S_TX_START & Cy_I2S_GetCurrentState(obj->base)));
#elif(defined(CY_IP_MXTDM))
    return (0u != (TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk & obj->base->TDM_TX_STRUCT.TX_FIFO_CTL));
#endif
}

bool _cyhal_audioss_is_tx_busy(_cyhal_audioss_t *obj)
{
    CY_ASSERT(NULL != obj);

    return (0 != _cyhal_audioss_get_num_in_fifo(obj, true)) || _cyhal_audioss_is_write_pending(obj);
}

bool _cyhal_audioss_is_rx_enabled(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    CY_ASSERT(NULL != obj);
#if defined(CY_IP_MXAUDIOSS)
    return (0 != (CY_I2S_RX_START & Cy_I2S_GetCurrentState(obj->base)));
#elif(defined(CY_IP_MXTDM))
    return (0u != (TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE_Msk & obj->base->TDM_RX_STRUCT.RX_FIFO_CTL));
#endif
#else
    CY_UNUSED_PARAMETER(obj);
    return false;
#endif
}

bool _cyhal_audioss_is_rx_busy(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    CY_ASSERT(NULL != obj);
    return (0 != _cyhal_audioss_get_num_in_fifo(obj, false)) || _cyhal_audioss_is_read_pending(obj);
#else
    CY_UNUSED_PARAMETER(obj);
    return false;
#endif
}

cy_rslt_t _cyhal_audioss_read_async(_cyhal_audioss_t *obj, void *rx, size_t rx_length)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->async_rx_buff = rx;
    obj->async_rx_length = rx_length;
    cyhal_system_critical_section_exit(savedIntrStatus);
    switch(obj->async_mode)
    {
        case CYHAL_ASYNC_SW:
        {
            /* Read as much as we can now, then set up an interrupt to do the rest
             * This is a potentially long operation but we don't want other I2S operations to
             * interleave with it. So do a "mini critical section" and disable the interrupts for this block only.
             */
            uint32_t old_events = _cyhal_audioss_disable_events(obj, false);
            // Safe to cast away volatile here because we're calling read_until_empty from within
            // a critical section, so it should not change out from under us during this call
            _cyhal_audioss_read_until_empty(obj, (void**)(&obj->async_rx_buff), (size_t*)(&obj->async_rx_length));
            _cyhal_audioss_update_rx_trigger_level(obj);
            _cyhal_audioss_restore_events(obj, false, old_events);
            if(obj->async_rx_length > 0)
            {
                _cyhal_audioss_update_enabled_events(obj);
            }
            else
            {
                _cyhal_audioss_process_event(obj, obj->interface->event_rx_complete);
            }
           break;
        }
        case CYHAL_ASYNC_DMA:
        {
            // Don't directly kick off the DMA here - it will be triggered
            // from the interrupt handler when the FIFO rised above the threshold
            // (which may have already happened by the time we get here if the
            // application already had the full or half-full event enabled)
            _cyhal_audioss_update_rx_trigger_level(obj);
            _cyhal_audioss_update_enabled_events(obj);
            break;
        }
        default:
           CY_ASSERT(0); /* Unrecognized async mode */
    }

    return CY_RSLT_SUCCESS;
#else
    CY_UNUSED_PARAMETER(rx);
    CY_UNUSED_PARAMETER(rx_length);
    return obj->interface->err_not_supported;
#endif
}

static void _cyhal_audioss_reconstruct_pdl_config(_cyhal_audioss_t *obj, _cyhal_audioss_pdl_config_t* pdl_config)
{
#if defined(CY_IP_MXAUDIOSS)
    I2S_Type* base = obj->base;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    pdl_config->txEnabled = _FLD2BOOL(I2S_CTL_TX_ENABLED, REG_I2S_CTL(base));
    pdl_config->rxEnabled = _FLD2BOOL(I2S_CTL_RX_ENABLED, REG_I2S_CTL(base));

    uint32_t rx_ctl_val = REG_I2S_RX_CTL(base);
    pdl_config->rxMasterMode = _FLD2BOOL(I2S_RX_CTL_MS, rx_ctl_val);
    pdl_config->rxAlignment  = (cy_en_i2s_alignment_t)_FLD2VAL(I2S_RX_CTL_I2S_MODE, rx_ctl_val);
    pdl_config->rxWsPulseWidth = (cy_en_i2s_ws_pw_t)_FLD2VAL(I2S_RX_CTL_WS_PULSE, rx_ctl_val);
    pdl_config->rxWatchdogEnable = _FLD2BOOL(I2S_RX_CTL_WD_EN, rx_ctl_val);
    pdl_config->rxWatchdogValue = REG_I2S_RX_WATCHDOG(base);
    pdl_config->rxSdiLatchingTime = _FLD2BOOL(I2S_RX_CTL_B_CLOCK_INV, rx_ctl_val);
    pdl_config->rxSckoInversion = _FLD2BOOL(I2S_RX_CTL_SCKO_POL, rx_ctl_val);
    pdl_config->rxSckiInversion = _FLD2BOOL(I2S_RX_CTL_SCKI_POL, rx_ctl_val);
    /* Register is one less than desired value */
    pdl_config->rxChannels = ((uint8_t)_FLD2VAL(I2S_RX_CTL_CH_NR, rx_ctl_val)) + 1;
    pdl_config->rxChannelLength = (cy_en_i2s_len_t)_FLD2VAL(I2S_RX_CTL_CH_LEN, rx_ctl_val);
    pdl_config->rxWordLength = (cy_en_i2s_len_t)_FLD2VAL(I2S_RX_CTL_WORD_LEN, rx_ctl_val);
    pdl_config->rxSignExtension = _FLD2BOOL(I2S_RX_CTL_SCKI_POL, rx_ctl_val);
    pdl_config->rxFifoTriggerLevel = _cyhal_audioss_fifo_trigger_level(obj, false);
#endif /* _CYHAL_AUDIOSS_RX_ENABLED */

