RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
#if defined(_CYHAL_AUDIOSS_TX_WATCHDOG_AVAILABLE)
        pdl_config->txWatchdogEnable = false;
        pdl_config->txWatchdogValue = 0u;
#endif

#if defined(_CYHAL_AUDIOSS_TRIGGERS_AVAILABLE)
        pdl_config->txDmaTrigger = false;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        pdl_config->rxDmaTrigger = false;
#endif
#endif

#if defined(_CYHAL_AUDIOSS_TX_SLAVE_AVAILABLE)
        pdl_config->txMasterMode = !hal_cfg->is_tx_slave;
        pdl_config->txSckiInversion = false;
        pdl_config->txSdoLatchingTime = false;
#endif
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        /* Should be the same because RX and TX mclk must be the same if they are both enabled */
        CY_ASSERT(sclk_div_rx == sclk_div_tx || false == pdl_config->txEnabled || false == pdl_config->rxEnabled);
        pdl_config->clkDiv = (uint8_t)(pdl_config->txEnabled ? sclk_div_tx : sclk_div_rx);
#else
        CY_UNUSED_PARAMETER(sclk_div_rx);
        pdl_config->clkDiv = (uint8_t)(sclk_div_tx);
#endif
        pdl_config->extClk = mclk_tx; /* No separate rx/tx mclk selection on this IP */
        CY_UNUSED_PARAMETER(mclk_rx);
        /* TDM mode A == channel data starts on rising edge of WS */
        pdl_config->txAlignment = hal_cfg->is_i2s ? CY_I2S_I2S_MODE : CY_I2S_TDM_MODE_A;
        pdl_config->txWsPulseWidth = hal_cfg->tx_ws_full
                                ? CY_I2S_WS_ONE_CHANNEL_LENGTH : CY_I2S_WS_ONE_SCK_CYCLE;

        pdl_config->txSckoInversion = false;

        pdl_config->txChannels = hal_cfg->num_channels;
        pdl_config->txChannelLength = pdl_channel_length_tx;
        pdl_config->txWordLength = pdl_word_length_tx;
        pdl_config->txOverheadValue = CY_I2S_OVHDATA_ZERO; /* Per HAL API specification */
        pdl_config->txFifoTriggerLevel = _CYHAL_AUDIOSS_FIFO_DEPTH / 2 + 1; /* Trigger at half empty */
    }
#elif defined(CY_IP_MXTDM)
    cy_en_tdm_ws_t pdl_word_length_rx, pdl_word_length_tx;
    cy_rslt_t result = _cyhal_audioss_length_to_pdl(obj->word_length_tx, &pdl_word_length_tx, obj);
    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_length_to_pdl(obj->word_length_rx, &pdl_word_length_rx, obj);
    }
    if(CY_RSLT_SUCCESS == result)
    {
        /* Configure TX */
        pdl_config->tx_config->enable = tx_en;
        pdl_config->tx_config->masterMode = hal_cfg->is_tx_slave ? CY_TDM_DEVICE_SLAVE : CY_TDM_DEVICE_MASTER;
        pdl_config->tx_config->wordSize = pdl_word_length_tx;
        pdl_config->tx_config->format = hal_cfg->is_i2s ? CY_TDM_LEFT_DELAYED : CY_TDM_LEFT;
        pdl_config->tx_config->clkDiv = sclk_div_tx;
        /* Only clock 0 from the srss hooked up on current hardware */
        pdl_config->tx_config->clkSel = mclk_tx ? CY_TDM_SEL_MCLK_IN : CY_TDM_SEL_SRSS_CLK0;
        pdl_config->tx_config->sckPolarity = CY_TDM_CLK;
        /* For I2S, frame sync aka word select starts out low */
        pdl_config->tx_config->fsyncPolarity = hal_cfg->is_i2s ? CY_TDM_SIGN_INVERTED : CY_TDM_SIGN;
        pdl_config->tx_config->fsyncFormat = hal_cfg->tx_ws_full ? CY_TDM_CH_PERIOD : CY_TDM_BIT_PERIOD;
        pdl_config->tx_config->channelNum = hal_cfg->num_channels;
        pdl_config->tx_config->channelSize = obj->channel_length_tx;
        pdl_config->tx_config->fifoTriggerLevel = _CYHAL_AUDIOSS_FIFO_DEPTH / 2 + 1; /* Trigger at half empty */
        pdl_config->tx_config->chEn = hal_cfg->channel_mask;
        pdl_config->tx_config->signalInput = 0; /* TX and RX signaling independent */
        pdl_config->tx_config->i2sMode = hal_cfg->is_i2s;

        /* Configure RX */
        pdl_config->rx_config->enable = rx_en;
        pdl_config->rx_config->masterMode = hal_cfg->is_rx_slave ? CY_TDM_DEVICE_SLAVE : CY_TDM_DEVICE_MASTER;
        pdl_config->rx_config->wordSize = pdl_word_length_rx;
        pdl_config->rx_config->format = hal_cfg->is_i2s ? CY_TDM_LEFT_DELAYED : CY_TDM_LEFT;
        pdl_config->rx_config->clkDiv = sclk_div_rx;
        /* Only clock 0 from the srss hooked up on current hardware */
        pdl_config->rx_config->clkSel = mclk_rx ? CY_TDM_SEL_MCLK_IN : CY_TDM_SEL_SRSS_CLK0;
        pdl_config->rx_config->sckPolarity = CY_TDM_CLK;
        /* For I2S, frame sync aka word select starts out low */
        pdl_config->rx_config->fsyncPolarity = hal_cfg->is_i2s ? CY_TDM_SIGN_INVERTED : CY_TDM_SIGN;
        pdl_config->rx_config->fsyncFormat = hal_cfg->rx_ws_full ? CY_TDM_CH_PERIOD : CY_TDM_BIT_PERIOD;
        pdl_config->rx_config->channelNum = hal_cfg->num_channels;
        pdl_config->rx_config->channelSize = obj->channel_length_rx;
        pdl_config->rx_config->fifoTriggerLevel = _CYHAL_AUDIOSS_FIFO_DEPTH / 2 + 1; /* Trigger at half empty */
        pdl_config->rx_config->chEn = hal_cfg->channel_mask;
        pdl_config->rx_config->signalInput = 0; /* TX and RX signaling independent */
        pdl_config->rx_config->i2sMode = hal_cfg->is_i2s;
    }
#else
#error "Unrecognized audio IP"
#endif
    return result;
}

// Round up the word length to the next power of 2
static uint8_t _cyhal_audioss_rounded_word_length(_cyhal_audioss_t *obj, bool is_tx)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    uint8_t word_length = is_tx ? obj->word_length_tx : obj->word_length_rx;
#else
    CY_UNUSED_PARAMETER(is_tx);
    uint8_t word_length = obj->word_length_tx;
#endif
    CY_ASSERT(word_length <= 32);
    if(word_length <= 8)
    {
        return 8u;
    }
    else if(word_length <= 16)
    {
        return 16u;
    }

    return 32u;
}

cy_rslt_t _cyhal_audioss_write_async(_cyhal_audioss_t *obj, const void *tx, size_t tx_length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->async_tx_buff = tx;
    obj->async_tx_length = tx_length;
    cyhal_system_critical_section_exit(savedIntrStatus);
    switch(obj->async_mode)
    {
        case CYHAL_ASYNC_SW:
        {
            /* Write as much as we can now, then set up an interrupt to do the rest
            * This is a potentially long operation but we don't want other I2S operations to
            * interleave with it. So do a "mini critical section" and disable the interrupts for this block only.
            */
            uint32_t old_events = _cyhal_audioss_disable_events(obj, true);
            // Safe to cast away volatile here because we're calling write_until_full from within
            // a critical section, so it should not change out from under us during this call
            _cyhal_audioss_write_until_full(obj, (const void**)(&obj->async_tx_buff), (size_t *)(&obj->async_tx_length));
            _cyhal_audioss_restore_events(obj, true, old_events);
            if(obj->async_tx_length > 0)
            {
                _cyhal_audioss_update_enabled_events(obj);
            }
            else
            {
                _cyhal_audioss_process_event(obj, obj->interface->event_tx_complete);
            }
            break;
        }
        case CYHAL_ASYNC_DMA:
        {
            // Don't directly kick off the DMA here - it will be triggered
            // from the interrupt handler when the FIFO drops below the threshold
            // (which may have already happened by the time we get here if the
            // application already had the half-empty or empty event enabled)
            _cyhal_audioss_update_enabled_events(obj);
            break;
        }
        default:
            CY_ASSERT(0); /* Unrecognized async mode */
            break;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t _cyhal_audioss_set_async_mode(_cyhal_audioss_t *obj, cyhal_async_mode_t mode, uint8_t dma_priority)
{
    CY_ASSERT(NULL != obj);

// We don't support swapping the async mode out from under a pending transfer.
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    CY_ASSERT(false == _cyhal_audioss_is_read_pending(obj));
#endif
    CY_ASSERT(false == _cyhal_audioss_is_write_pending(obj));

    cy_rslt_t result = CY_RSLT_SUCCESS;

    if(mode == CYHAL_ASYNC_DMA)
    {
        // Reserve a DMA channel for each direction that is enabled
        if(_cyhal_audioss_is_direction_enabled(obj, true) && CYHAL_RSC_INVALID == obj->tx_dma.resource.type)
        {
            /* Reserve a DMA channel for async transmit if tx is enabled */
            result = cyhal_dma_init(&obj->tx_dma, CYHAL_DMA_PRIORITY_DEFAULT, CYHAL_DMA_DIRECTION_MEM2PERIPH);
            cyhal_dma_register_callback(&obj->tx_dma, &_cyhal_audioss_dma_handler_tx, obj);
        }
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        if(_cyhal_audioss_is_direction_enabled(obj, false) && CYHAL_RSC_INVALID == obj->rx_dma.resource.type)
        {
            /* Reserve a DMA channel for async receive if rx is enabled */
            result = cyhal_dma_init(&obj->rx_dma, CYHAL_DMA_PRIORITY_DEFAULT, CYHAL_DMA_DIRECTION_PERIPH2MEM);
            cyhal_dma_register_callback(&obj->rx_dma, &_cyhal_audioss_dma_handler_rx, obj);
        }
#endif
    }
    else
    {
        /* Free the DMA instances if we reserved them but don't need them anymore */
        if(CYHAL_RSC_INVALID != obj->tx_dma.resource.type)
        {
            cyhal_dma_free(&obj->tx_dma);
            obj->tx_dma.resource.type = CYHAL_RSC_INVALID;
        }
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        if(CYHAL_RSC_INVALID != obj->rx_dma.resource.type)
        {
            cyhal_dma_free(&obj->rx_dma);
            obj->rx_dma.resource.type = CYHAL_RSC_INVALID;
        }
#endif
    }

    if(CY_RSLT_SUCCESS == result)
    {
        obj->async_mode = mode;
        obj->async_dma_priority = dma_priority;
    }
    return result;
}

