RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
        result = cyhal_dma_start_transfer(&(obj->rx_dma));
    }

    return result;
}
#endif

static cy_rslt_t _cyhal_audioss_dma_perform_tx(_cyhal_audioss_t *obj)
{
    // We could have received an event after the DMA brought the FIFO below the
    // threshold but before the DMA is entirely complete
    if(cyhal_dma_is_busy(&(obj->tx_dma)))
        return CY_RSLT_SUCCESS;

    CY_ASSERT(NULL != obj->async_tx_buff);

    /* ISR triggers when the FIFO count less than the trigger level */
    size_t transfer_size = _cyhal_audioss_fifo_trigger_level(obj, true) + 1;
    if (transfer_size >= obj->async_tx_length)
    {
        transfer_size = obj->async_tx_length;
        // Only want the user callback to be call on the last dma transfer.
        cyhal_dma_enable_event(&(obj->tx_dma), CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, true);
    }

    cyhal_dma_cfg_t dma_cfg =
    {
        .src_addr = (uint32_t)obj->async_tx_buff,
        .src_increment = 1,
#if defined(CY_IP_MXAUDIOSS)
        .dst_addr = (uint32_t)(&(obj->base->TX_FIFO_WR)),
#elif defined(CY_IP_MXTDM)
        .dst_addr = (uint32_t)(&(obj->base->TDM_TX_STRUCT.TX_FIFO_WR)),
#endif
        .dst_increment = 0,
        .transfer_width = _cyhal_audioss_rounded_word_length(obj, true),
        .length = transfer_size,
        .burst_size = 0,
        .action = CYHAL_DMA_TRANSFER_FULL,
    };
    cy_rslt_t result = cyhal_dma_configure(&(obj->tx_dma), &dma_cfg);

    if(CY_RSLT_SUCCESS == result)
    {
        result = cyhal_dma_enable(&(obj->tx_dma));
    }

    // Update the buffer first so that it's guaranteed to be correct whenever the DMA completes
    if(CY_RSLT_SUCCESS == result)
    {
        size_t increment_bytes = transfer_size * (_cyhal_audioss_rounded_word_length(obj, true) / 8);
        uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
        obj->async_tx_buff = (void*)(((uint8_t*) obj->async_tx_buff) + increment_bytes);
        obj->async_tx_length -= transfer_size;

        // Do this after we've updated async_tx_buff/length because once we have kicked
        // off the final DMA transfer there is no further action we will take on the
        // half-empty/empty events, and we don't want those to wind upstarving the
        // DMA complete event
        _cyhal_audioss_update_enabled_events(obj);
        cyhal_system_critical_section_exit(savedIntrStatus);

        result = cyhal_dma_start_transfer(&(obj->tx_dma));
    }

    return result;
}

static uint32_t _cyhal_audioss_get_num_in_fifo(_cyhal_audioss_t *obj, bool is_tx)
{
#if defined(CY_IP_MXAUDIOSS)
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    return is_tx ? Cy_I2S_GetNumInTxFifo(obj->base) : Cy_I2S_GetNumInRxFifo(obj->base);
#else
    CY_UNUSED_PARAMETER(is_tx);
    return Cy_I2S_GetNumInTxFifo(obj->base);
#endif
#elif defined(CY_IP_MXTDM)
    return is_tx ? Cy_AudioTDM_GetNumInTxFifo(&obj->base->TDM_TX_STRUCT)
                 : Cy_AudioTDM_GetNumInRxFifo(&obj->base->TDM_RX_STRUCT);
#endif
}

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static uint32_t _cyhal_audioss_read_fifo(_cyhal_audioss_t *obj)
{
#if defined(CY_IP_MXAUDIOSS)
    return Cy_I2S_ReadRxData(obj->base);
#elif defined(CY_IP_MXTDM)
    return Cy_AudioTDM_ReadRxData(&obj->base->TDM_RX_STRUCT);
#endif
}
#endif

static void _cyhal_audioss_write_fifo(_cyhal_audioss_t *obj, uint32_t value)
{
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_WriteTxData(obj->base, value);
#elif defined(CY_IP_MXTDM)
    Cy_AudioTDM_WriteTxData(&obj->base->TDM_TX_STRUCT, value);
#endif
}

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
/* Callback argument is the I2S instance */
static void _cyhal_audioss_dma_handler_rx(void *callback_arg, cyhal_dma_event_t event)
{
    CY_UNUSED_PARAMETER(event);
    /* We only hook this handler up when we're doing the final transfer, so send the completed event */
    CY_ASSERT(CYHAL_DMA_TRANSFER_COMPLETE == event);

    _cyhal_audioss_t *obj = (_cyhal_audioss_t*)callback_arg;
    obj->async_rx_buff = NULL;
    cyhal_dma_enable_event(&obj->rx_dma, CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, false);
    _cyhal_audioss_process_event(obj, obj->interface->event_rx_complete);
}
#endif

/* Callback argument is the I2S instance */
static void _cyhal_audioss_dma_handler_tx(void *callback_arg, cyhal_dma_event_t event)
{
    CY_UNUSED_PARAMETER(event);
    /* We only hook this handler up when we're doing the final transfer, so send the completed event */
    CY_ASSERT(CYHAL_DMA_TRANSFER_COMPLETE == event);

    _cyhal_audioss_t *obj = (_cyhal_audioss_t*)callback_arg;
    obj->async_tx_buff = NULL;
    cyhal_dma_enable_event(&obj->tx_dma, CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, false);
    _cyhal_audioss_process_event(obj, obj->interface->event_tx_complete);
}

static void _cyhal_audioss_process_event(_cyhal_audioss_t *obj, uint32_t event)
{
    if(0 != (event & (obj->interface->event_mask_empty | obj->interface->event_mask_half_empty)))
    {
        /* We should normally not get the "empty" interrupt during an async transfer because we
         * should be topping the FIFO back up after each half-empty interrupt. But in case something
         * delays our response and the FIFO gets all the way to empty, listen for that as well
         */
        uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
        if(NULL != obj->async_tx_buff && obj->async_tx_length > 0)
        {
            switch(obj->async_mode)
            {
                case CYHAL_ASYNC_SW:
                {
                    /* Write as much as we can out until the FIFO is full
                     * This is a potentially long operation but we don't want other I2S operations to
                     * interleave with it. So switch to a "mini critical section" and disable the
                     * interrupts for this block only while we're copying
                     */
                    uint32_t old_events = _cyhal_audioss_disable_events(obj, true);
                    cyhal_system_critical_section_exit(savedIntrStatus);
                    // Safe to cast away volatile here because we're calling write_until_full from within
                    // a critical section, so it should not change out from under us during this call
                    _cyhal_audioss_write_until_full(obj, (const void**)(&obj->async_tx_buff), (size_t *)(&obj->async_tx_length));

                    // Re-enter the global critical section so that the exit below behaves correctly
                    savedIntrStatus = cyhal_system_critical_section_enter();
                    _cyhal_audioss_restore_events(obj, true, old_events);
                    if(0 == obj->async_tx_length)
                    {
                        /* We finished the async transfer. */
                        event |= obj->interface->event_tx_complete;
                    }
                    break;
                }
                case CYHAL_ASYNC_DMA:
                {
                    cy_rslt_t result = _cyhal_audioss_dma_perform_tx(obj);
                    CY_UNUSED_PARAMETER(result);
                    CY_ASSERT(CY_RSLT_SUCCESS == result);
                    break;
                }
                default:
                    CY_ASSERT(0); /* Unrecognized async mode */
                    break;
            }
        }

