RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_audio_common.c
        cyhal_system_critical_section_exit(savedIntrStatus);
    }

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(0 != (event & (obj->interface->event_mask_full | obj->interface->event_mask_half_full)))
    {
        /* Similar to TX, we don't expect to receive the "full" interrupt, but check for it out of caution */
        uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
        if(NULL != obj->async_rx_buff && obj->async_rx_length > 0)
        {
            switch(obj->async_mode)
            {
                case CYHAL_ASYNC_SW:
                {
                   /* Read as much as we can until the FIFO is empty
                     * This is a potentially long operation but we don't want other I2S operations to
                     * interleave with it. So switch to a "mini critical section" and disable the
                     * interrupts for this block only while we're copying
                    */
                   uint32_t old_events = _cyhal_audioss_disable_events(obj, false);
                   cyhal_system_critical_section_exit(savedIntrStatus);
                   // Safe to cast away volatile here because we're calling read_until_empty from within
                   // a critical section, so it should not change out from under us during this call
                   _cyhal_audioss_read_until_empty(obj, (void**)(&obj->async_rx_buff), (size_t*)(&obj->async_rx_length));
                   // Re-enter the global critical section so that the exit below behaves correctly
                   savedIntrStatus = cyhal_system_critical_section_enter();
                   _cyhal_audioss_restore_events(obj, false, old_events);
                   _cyhal_audioss_update_enabled_events(obj);
                   if(0 == obj->async_rx_length)
                   {
                       /* We finished the async transfer.  */
                       event |= obj->interface->event_rx_complete;
                   }
                   break;
                }
                case CYHAL_ASYNC_DMA:
                   _cyhal_audioss_dma_perform_rx(obj);
                   break;

                default:
                   CY_ASSERT(0); /* Unrecognized async mode */
            }

            // During async rx transfers, we may temporarily set the trigger level below half-full.
            // So make sure that it's a real "half full" and skip propagating to the user if it isn't
#if defined(CY_IP_MXAUDIOSS)
            uint8_t trigger_level = (obj->base->RX_FIFO_CTL & I2S_RX_FIFO_CTL_TRIGGER_LEVEL_Msk) >> I2S_RX_FIFO_CTL_TRIGGER_LEVEL_Pos;
#elif defined(CY_IP_MXTDM)
            uint8_t trigger_level = (obj->base->TDM_RX_STRUCT.RX_FIFO_CTL & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_TRIGGER_LEVEL_Msk) >> TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_TRIGGER_LEVEL_Pos;
#endif
            if(trigger_level != obj->user_fifo_level_rx)
            {
                event &= ~(obj->interface->event_mask_half_full);
            }
        }

        cyhal_system_critical_section_exit(savedIntrStatus);
    }
#endif

    /* Mark async transfer as complete if we just finished one. */
    if(0 != (event & obj->interface->event_tx_complete))
    {
        obj->async_tx_buff = NULL;
        _cyhal_audioss_update_enabled_events(obj);
    }

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(0 != (event & obj->interface->event_rx_complete))
    {
        obj->async_rx_buff = NULL;
        _cyhal_audioss_update_enabled_events(obj);
    }
#endif

    if(0 != (event & obj->user_enabled_events))
    {
        obj->interface->invoke_user_callback(obj, event & obj->user_enabled_events);
    }
}

static bool _cyhal_audioss_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg)
{
    _cyhal_audioss_t *obj = (_cyhal_audioss_t *)callback_arg;
    CY_UNUSED_PARAMETER(state);

    switch(mode)
    {
        case CYHAL_SYSPM_CHECK_READY:
        {
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
            bool is_active = _cyhal_audioss_is_rx_enabled(obj)
                          || _cyhal_audioss_is_tx_enabled(obj);
            obj->pm_transition_ready = !is_active && !(_cyhal_audioss_is_read_pending(obj) || _cyhal_audioss_is_tx_busy(obj));
#else
            bool is_active = _cyhal_audioss_is_tx_enabled(obj);
            obj->pm_transition_ready = !is_active && !_cyhal_audioss_is_tx_busy(obj);
#endif
            return obj->pm_transition_ready;
        }
        case CYHAL_SYSPM_CHECK_FAIL:
        case CYHAL_SYSPM_AFTER_TRANSITION:
            obj->pm_transition_ready = false;
            return true;
        default:
            return true;
    }
}

#if defined(_CYHAL_AUDIOSS_TRIGGERS_AVAILABLE)
static cyhal_source_t _cyhal_audioss_calculate_source(_cyhal_audioss_t *obj, bool is_rx)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    return is_rx ? _cyhal_audioss_rx_trigger[obj->resource.block_num] : _cyhal_audioss_tx_trigger[obj->resource.block_num];
#else
    CY_UNUSED_PARAMETER(is_rx);
    return _cyhal_audioss_tx_trigger[obj->resource.block_num];
#endif
}
#endif

cy_rslt_t _cyhal_audioss_enable_output(_cyhal_audioss_t *obj, bool is_rx, cyhal_source_t *source)
{
#if defined(_CYHAL_AUDIOSS_TRIGGERS_AVAILABLE)
    #if defined(CY_IP_MXAUDIOSS) /* On MXTDM the trigger lines are always enabled */
    if(is_rx)
    {
        REG_I2S_TR_CTL(obj->base) |= I2S_TR_CTL_RX_REQ_EN_Msk;
    }
    else
    {
        REG_I2S_TR_CTL(obj->base) |= I2S_TR_CTL_TX_REQ_EN_Msk;
    }
    #endif

    *source = _cyhal_audioss_calculate_source(obj, is_rx);
    return CY_RSLT_SUCCESS;
#else
    CY_UNUSED_PARAMETER(is_rx);
    CY_UNUSED_PARAMETER(source);
    return obj->interface->err_not_supported;
#endif
}

cy_rslt_t _cyhal_audioss_disable_output(_cyhal_audioss_t *obj, bool is_rx)
{
#if defined(_CYHAL_AUDIOSS_TRIGGERS_AVAILABLE)
    #if defined(CY_IP_MXAUDIOSS)
    if(is_rx)
    {
        REG_I2S_TR_CTL(obj->base) &= ~I2S_TR_CTL_RX_REQ_EN_Msk;
    }
    else
    {
        REG_I2S_TR_CTL(obj->base) &= ~I2S_TR_CTL_TX_REQ_EN_Msk;
    }
    #else
    /* On MXTDM the trigger lines are always enabled */
    CY_UNUSED_PARAMETER(obj);
    CY_UNUSED_PARAMETER(is_rx);
    #endif

    return CY_RSLT_SUCCESS;
#else
    CY_UNUSED_PARAMETER(is_rx);
    return obj->interface->err_not_supported;
#endif
}


#if defined(__cplusplus)
}
#endif

#endif /* CYHAL_DRIVER_AVAILABLE_I2S */
